import React from 'react';
import { View, Text, StyleSheet, Image, ScrollView,TouchableOpacity,ImageBackground  } from 'react-native';
import { useNavigation } from '@react-navigation/native';
function LandmarksScreen() {
  const navigation = useNavigation();
  return (
    <ImageBackground 
    source={require('./assets/Eksponat3.jpg')}  // Пътят до вашата фонова снимка
    style={styles.backgroundImage}
    resizeMode="cover" // Опцията 'cover' уверява, че снимката ще покрива цялата площ без да се разтяга неправилно
  >
    <ScrollView contentContainerStyle={styles.container}>
      <View style={styles.item}>
        <Image 
          source={require('./assets/5.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Белоградчишките скали са група скални образувания от пясъчник и конгломерати със 
        странна форма , разположени в западните склонове на Стара планина
        близо до град Белоградчик в Северозападна България .
        Скалите варират по цвят от предимно червено до жълто;
        някои от скалите достигат до 200 м височина. Много скали имат
        фантастични форми и са свързани с интересни легенди. Те често
        са кръстени на хора или предмети, на които се смята, че приличат.
        Белоградчишките скали са обявени за природна забележителност от
        българското правителство и са основна туристическа атракция в 
        региона. Те са единственото местообитание на критично 
        застрашения български ендемит Белоградски тамян .
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/App2.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Белоградчишката крепост е крепост, която се намира
         непосредствено до град Белоградчик, България.
        В исторически аспект крепостта е най-голямата
          културна забележителност на град Белоградчик. 
        Към Белоградчишкото кале и към Белоградчишките скали
          е насочен основният туристически поток на района. 
        Белоградчишката крепост е една от най-запазените крепости 
          в България и е обявена за паметник на културата от 
          национално значение.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/muzei.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Историческия музей в град Белоградчик се намира на 100м 
        от центъра на града, на централния път по посока към
        белоградчишката крепост „Калето“.
        Историческия музей се помещава в Пановата къща. 
        Експозициите в музея акцентират върху борбата на
        местното население срещу османския поробител. Отразено
        е въстанието от 1850г. срещу османския поробител. 
        Показани са събитията свързани с освобождението на
        Белоградчик от османско робство. Показани са и експозиции
        свързани с бита на местното население и народни носии.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/magurata.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Пещера Магурата е една от най-големите,
        най-красивите и най-посещаваните български пещери.
        Намира се в Северозападна България, на 17 км от 
        гр. Белоградчик и Белоградчишките скали, във варовиковата
        Рабишка могила - 461 м н.в. Състои се от главна галерия
        и три странични разклонения. Общата дължина на откритите
        галерии е около 2500 м. Температурата в пещерата варира
        от 12,2 до  12,9  градуса по Целзии целогодишно. 
        Според геоложки проучвания образуването на пещерата 
        Магура е започнало преди около 15 млн. години. В една 
        от залите са разкрити праисторически рисунки, издълбани
        в скалата и изрисувани с прилепно гуано (тор). Фигурите
        изобразяват танцуващи женски силуети, танцуващи и
        ловуващи мъже, маскирани хора, животни, звезди, оръдия
        на труда, растения. Рисунките датират от различни 
        епохи - епипалеолит, неолит, енеолит, начало на 
        раннобронзовата епоха. Слънчевият годишен
        календар от късния неолит, открит там, 
        е най-ранният слънчев календар, открит досега в 
        Европа. Той е изрисуван по стените на залата 
        светилище и на него са отбелязани поне 5 празника,
        както и 366 дни. В пещерата са открити кости от 
        пещерна мечка, пещерна хиена и др.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/rabisha.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Рабишкото езеро е най-голямото по площ вътрешно езеро
        в България и седмо измежду всички езера в страната.
        Разположено е в Област Видин между селата Толовица,
        община Макреш и Рабиша, община Белоградчик, в западния
        край на Предбалкана, в североизточното подножие на Рабишката
        могила. Площта му е 3,25 км², дължината – до 1,4 км, 
        а дълбочината му достига 10 – 15 метра. Пълен обем – 43,2 млн. куб. м.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/Venetsa.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Пещера Венеца се смята за една от най-красивите в страната
        заради многото на брой и различни образувания. За красотата 
        допринася и цветното осветление, което представя различните 
        образувания по един съвсем различен за България начин.
        Можете да видите следните образувания: ледени кристали,
        сталактити, сталагмити, аргонитни кристали, гроздовиден
        сталактит (много рядко се среща в пещерите в България), 
        дендрити и др. Има оприличено на Дева Мария образувание…
        По целия под са разпръснати различни на цвят кристали,
        дължащи се на кристализацията на водата и минералите в
        заобикалящите ги скали. Пещерата се смята за изключително
        красива със своите калцитни образувания.
        В пещерата има множество образувания от полускъпоценния
        камък Оникс и кристали, които се наричат оргонити.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/lepenica2.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Пещерата Лепеница се намира в местността Маркащница,
        на 4км от Белоградчик. Тя е в средата на Белоградчишките
        скали и в средата на светилищния комплекс в Маркащница. 
        Входната камера на пещерата е пресечена на два етажа, 
        а самата тя е хоризонтална и отворена за преходи в недрата
        на земята както Магурата. Според изчисленията тя е на
        8000-8500 години, като най-старите артефакти 
        намерени в нея са на около 7000 години.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/Eksponat3.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Това е единственият природонаучен музей в Северозападна България.
        Експозицията му съдържа 520, а общият му фонд е 3000 експоната 
        от флората и фауната в този край на България.
        В музея са изложени фотографии, макети и фигури на животни, 
        а има и библиотека, в която могат да бъдат открити специализирани
        документи, данни от проучвания, и др.
        Част от най-интересните образци от фаунта, които могат да се
        видят в музея, са скален орел, синя гарга, лешояд, забулена сова, 
        черен щъркел, сокол, дива свиня, сънливец, сърна, елен, видра, 
        златка, лисица, вълк, сухоземнa костенуркa и др. а от 
        флората - орхидеи, червеникав дебелец (Sempervivum erythraeum),
        пурпурна метличина, стефчовата тлъстига (Sedum stefco), 
        Томасиниев минзухар, Сръбска рамонда,Български ерантис.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/images.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Обсерваторията е основана през 1961 година по идея на местния 
        учител по физика Христо Костов и става първата училищна 
        обсерватория в страната. До средата на 70-те години тя се 
        използва от Института по астрономия като база за наблюдение на 
        изкуствените спътници на Земята, а от 1976 година Институтът 
        поема изцяло дейността на съоръжението.
        Първоначално обсерваторията разполага с един 15-сантиметров 
        телескоп тип Касегрен, произведен от Цайс. През 1969 г. в 6-метров
        купол е монтиран 60-сантиметров телескоп, отново тип Касегрен на 
        Цайс, който е вторият по големина телескоп в страната. През 1994
        година е доставен трети телескоп, 14-инчов от тип Шмит-Касегрен,
        произведен от Селестрон и монтиран в построения преди това 4-метров купол.
        </Text>
      </View>

      <View style={styles.item}>
        <Image 
          source={require('./assets/hudojestvena.jpg')} 
          style={styles.image} 
        />
        <Text style={styles.description}>
        Художествената галерия в Белоградчик е открита през 1983г. 
        В нея са изложени над 180 платна – графика и живопис, 
        сред които произведения на много известни български художници 
        като Владимир Димитров-Майстора, Светлин Русев ,Стоян Венев,
        Иван Христов, Йоан Левиев, Бахит Бапишев и др.
        Освен постоянната експозиция, в галерията често се провеждат
        временни изложби.
        </Text>
      </View>
      <TouchableOpacity style={styles.backButton} onPress={() => navigation.goBack()}>
        <Text style={styles.buttonText}>Назад</Text>
      </TouchableOpacity>
    
    </ScrollView>
  
    </ImageBackground>
    
  );
}

const styles = StyleSheet.create({
  backgroundImage: {
    flex: 1,
    width: '100%', // Уверете се, че изображението покрива цялата ширина
    height: '100%', // и височина на екрана
  },
   
  container: {
    padding: 20,
  },
  item: {
    marginBottom: 20,
    alignItems: 'center',
  },
  image: {
    width: '100%',
    height: 300,
    resizeMode: 'contain',
    marginBottom: 10,
  },
  description: {
    fontSize: 16,
    textAlign: 'center',
    color: 'white',
  },
  backButton: {
    marginTop: 20,
    padding: 10,
    backgroundColor: 'green',
    borderRadius: 15,
    alignItems: 'center',
    justifyContent: 'center',
  },
  buttonText: {
    color: 'white',
    fontWeight: 'bold',
  },
});

export default LandmarksScreen;
